// ==========================================
//  ملف بيانات المنتجات (يتم تحديثه تلقائيًا)
// ==========================================
var products = [
    {
        "id": 1,
        "name": "Sutiafeed شفاط حليب الثدي\n",
        "price": 4950,
        "image": "https://via.placeholder.com/300",
        "description": "Sutiafeed شفاط حليب الثدي مناسب للإرتداء تحت الملابس ومصمم بشكل ٱمن لمنع التسرب\n– مريح و بدون آلم\n– صوت هادئ أثناء التشغيل\n– ٣ أنظمة للشفط, ٩ مستويات لكل نظام\n– شاشة LED لسهولة التحكم\n– بطارية ليثيوم قابلة للشحن\n– Sutiafeed شفاط حليب الثدي يدعم الشحن السريع ، مزود بوصلة USB Tybe C\n– ملحق به ٣ مقاسات مختلفة من وسادة الشفط (١٧،٢١،٢٥)"
    }
];